In [1]:
import numpy as np
import pandas as pd

# dictionary
dict1 ={
    "name":['Harry','Rohan','skillf','shubh'],
    "marks":[92,34,24,17],
    "city":['rampur','kolkata','bareilly','antarctica']
}

In [7]:
df = pd.DataFrame(dict1) # ye dataframe create kr dega
                          # DATAFRAME : think dataframe as an excel sheet
df

     name  marks        city
0   Harry     92      rampur
1   Rohan     34     kolkata
2  skillf     24    bareilly
3   shubh     17  antarctica

In [14]:
# To export this dataframe into csv 
df.to_csv('friends.csv') # this will create a file named friends.csv
df

     name  marks        city
0   Harry     92      rampur
1   Rohan     34     kolkata
2  skillf     24    bareilly
3   shubh     17  antarctica

In [15]:
df.to_csv('friends_index_False.csv',index=False) 
df

     name  marks        city
0   Harry     92      rampur
1   Rohan     34     kolkata
2  skillf     24    bareilly
3   shubh     17  antarctica

In [17]:
df.head(2) # starting ki 2 rows

    name  marks     city
0  Harry     92   rampur
1  Rohan     34  kolkata

In [19]:
df.tail(2) # ending ki 2 rows

     name  marks        city
2  skillf     24    bareilly
3   shubh     17  antarctica

In [22]:
df.describe() # statistical analysis : ye sari chize calculate krdega

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [26]:
human = pd.read_csv('human.csv')
human

   Train NO  Speed        City
0        70     92      rampur
1        80     34     kolkata
2        90     24    bareilly
3        99     17  antarctica

In [27]:
human['Speed'] # print speed column

0    92
1    34
2    24
3    17
Name: Speed, dtype: int64

In [28]:
human['Speed'][0] # print speed column's first element

92

In [32]:
human['Speed'][0] =3333 # set speed column's first element = 3333
human

/tmp/ipykernel_23909/2918535791.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  human['Speed'][0] =3333 # set speed column's first element =3333

   Train NO  Speed        City
0        70   3333      rampur
1        80     34     kolkata
2        90     24    bareilly
3        99     17  antarctica

In [ ]:
# to change index : index can be anything (number , string , character ) etc